---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarConstraintsManager
source: html/c0ea35cf-f8da-bee5-9264-82473ed37d0c.htm
---
# RebarConstraintsManager Methods

Returns true if references are valid targets for handle, false otherwise.